package lesson7;

/**
 * Создать массив типа String с размером 7.
 * Записать в него значения дней недели.
 * Вывести на консоль значение последнего элемента.
 */
public class ArrayString {
    public static void main(String[] args) {
        String[] array = new String[7];
        array[0] = "Понедельник";
        array[1] = "Вторник";
        array[2] = "Среда";
        array[3] = "Четверг";
        array[4] = "Пятница";
        array[5] = "Суббота";
        array[6] = "Воскресенье";
        System.out.println(array[6]);
    }
}
