package lesson7;

/**
 * Создать массив типа  double с размером 4.
 * Записать в него любые значения с помощью блока для инициализации.
 * Вывести на консоль значение первого элемента.
 */
public class DoubleString {
    public static void main(String[] args) {
        double[] array = {4.5, 5, 8.1, 6};
        System.out.println(array[0]);
    }
}
